import random


# функция, которая посчитает число пи
def count_pi(n):
    # общее количество бросков
    i = 0
    # сколько из них попало в круг
    count = 0
    # пока мы не дошли до финального броска
    while i < n:
        # случайным образом получаем координаты x и y
        x = random.random()
        y = random.random()
        # проверяем, попали мы в круг или нет
        if (pow(x, 2) + pow(y, 2)) < 1:
            # если попали — увеличиваем счётчик на 1
            count += 1
        # в любом случае увеличиваем общий счётчик
        i += 1
    # считаем и возвращаем число пи
    return 4 * (count / n)


# запускаем функцию
pi = count_pi(10000000)
# выводим результат
print(pi)